---
layout: default2014
title: Improve your user stories!
txt: Une occasion unique de suivre une formation dispens&eacute;e par Gojko Adzic
image: formation.jpg
wide-image: formation-wide.jpg
js:
- /static/js/post.js
- /static/js/post-formation.js
---

<!-- PAGE BLOG -->
<section class="page-section with-sidebar sidebar-right">
    <div class="container">
        <div class="row">

            <!-- Content -->
            <section id="content" class="content col-sm-12 col-md-12">

                <article class="post-wrap" data-animation="fadeInUp" data-animation-delay="100">
                    <div class="post-header">
                        <h2 class="post-title"><a href="#">Formation pr&eacute;-&eacute;v&eacute;nementielle</a></h2>
                        <div class="post-meta">
                <span class="post-date">
                    Post&eacute;
                    <span class="day">26</span>
                    <span class="month">ao&ucirc;t</span>
                    <span class="year">2014</span>
                </span>
                        </div>
                    </div>
                    <div class="post-body">
                        <div class="post-excerpt">

                            <p>
                                Cette ann&eacute;e, l'Agile Tour Bordeaux sera pr&eacute;c&eacute;d&eacute; de 2 journ&eacute;es de formation par Gojko Adzic !
                                Cet atelier aura lieu les 29 et 30 Octobre 2014 et sera enti&egrave;rement en anglais.
                            </p>

                            <div class="content col-sm-12 col-md-4">
                                <h3 class="post-title">About the trainer/author</h3>
                                <p><img src="/static/img/gojko.jpg" class="picture"/></p>
                                <p>
                                    Gojko Adzic is a strategic software delivery consultant who works with ambitious teams to improve the quality of their software products and processes. He specialises in agile and lean quality improvement, in particular agile testing, specification by example and behaviour driven development.
                                </p>
                                <p>
                                    Gojko’s book Specification by Example was awarded the #2 spot on the top 100 agile books for 2012 and won the Jolt Award for the best book of 2012. In 2011, he was voted by peers as the most influential agile testing professional, and his blog won the UK agile award for the best online publication in 2010.
                                </p>
                            </div>

                            <div class="content col-sm-12 col-md-8">

                                <div class="btn-group" data-toggle="buttons">
                                    <label class="btn btn-primary active">
                                        <input type="radio" name="language" checked value="fr"> <img src="/static/img/blog/fr.gif">
                                    </label>
                                    <label class="btn btn-primary">
                                        <input type="radio" name="language" value="en"> <img src="/static/img/blog/us.gif">
                                    </label>
                                    <span style="top: 9px;left: 5px;position: relative;font-weight:bold;">Un participant bilingue facilitera la compréhension de la formation durant les 2 jours</span>
                                </div>

                                <hr>

                                <div id="formation-en" class="hide">

                                <h3 class="post-title">Improve Your User Stories</h3>
                                <p>
                                    Many teams now have reasonably good tech practices, but things coming into their work stream are not defined well, not split well, not valuable enough in isolation, and generally not the kind of user stories that give people the big benefits that they expect. Join this workshop to try out a few small changes to the way you can manage user stories, which will make a huge impact on the actual outcomes of your software delivery.
                                    <blockquote>“I had the fortunate experience of attending Gojko Adzic’s workshop at Booster 2014 on improving user stories. I must say, that for me it was more like ‘radically rethinking the way you’re doing user stories’” <a href="http://campus.miles.no/2014/04/03/improving-user-stories">Ørjan Taule</a></blockquote>
                                </p>

                                <h3 class="post-title">Key Learning Points</h3>
                                <p>This is a brand new workshop based on Gojko Adzic’s upcoming book <a href="https://leanpub.com/50quickideas">50 Quick Ideas to Improve Your User Stories</a>, and years of experience helping teams deliver better software. It is highly interactive. Through groupwork with your peers and colleagues, you will discover:</p>
                                <ul>
                                    <li>How to define and plan with user stories so that delivery teams and business stakeholders get the most value out of them</li>
                                    <li>How to split user stories so they are small but valuable</li>
                                    <li>How to determine which user stories are useful and which are just noise</li>
                                    <li>How to avoid getting stuck in ‘technical stories’</li>
                                    <li>How to enable business sponsors to make decisions on flexible scope and avoid water-scrum-fall</li>
                                    <li>How to effectively prioritise and avoid pet features that will not produce impact</li>
                                    <li>How to keep the big picture even when working with small stories to avoid a user story stream of consciousness</li>
                                    <li>How to engage business sponsors in a high-level discussion to prioritise effectively</li>
                                    <li>How to spot and avoid the most common problems teams have with user stories</li>
                                </ul>

                                <h3 class="post-title">Intended Audience</h3>
                                <p>This is a workshop for a broad audience of anyone involved in iterative (agile/lean/scrum/kanban) delivery with user stories. Business sponsors of projects will learn how to communicate better with delivery teams and delivery team members (developers, testers, analysts, product owners) will learn how to engage their business users better.</p>

                                </div>

                                <div id="formation-fr">

                                    <h3 class="post-title">Am&eacute;liorez vos stories utilisateurs</h3>
                                    <p>
                                        Beaucoup d’&eacute;quipes ont d&eacute;sormais de bonnes pratiques techniques, mais les choses arrivant dans leurs flux de travail ne sont pas bien d&eacute;finies, ne sont pas bien d&eacute;coup&eacute;es, n’ont pas suffisamment de valeur ind&eacute;pendamment les unes des autres, et ne sont globalement pas le style de story apportant aux utilisateurs les b&eacute;n&eacute;fices qu’ils esp&eacute;raient. Inscrivez-vous &agrave; cet atelier pour essayer quelques petits changements dans la façon de g&eacute;rer des stories utilisateurs, qui auront un impact important sur les r&eacute;sultats de vos livrables.
                                    <blockquote>“J’ai eu l’occasion de participer &agrave; l’atelier de Gojko Adzic au Booster 2014 sur l’am&eacute;lioration des stories utilisateurs. Je dois dire que selon moi ça ressemblait plus &agrave; ‘radicalement repenser la façon de faire des stories utilisateurs’” <a href="http://campus.miles.no/2014/04/03/improving-user-stories">Ørjan Taule</a></blockquote>
                                    </p>

                                    <h3 class="post-title">Points Clés d’apprentissage</h3>
                                    <p>C’est un tout nouvel atelier bas&eacute; sur l’œuvre de Gojko Adzic <a href="https://leanpub.com/50quickideas">50 Quick Ideas to Improve Your User Stories</a>, ainsi que des ann&eacute;es d’exp&eacute;rience qu’il a pass&eacute; &agrave; aider les &eacute;quipes &agrave; livrer de meilleurs logiciels. C’est tr&egrave;s interactif. A travers les groupes de travaux avec vos pairs et coll&egrave;gues, vous d&eacute;couvrirez :</p>
                                    <ul>
                                        <li>Comment d&eacute;finir et planifier les user stories pour que les &eacute;quipes de livraison ainsi que l’ensemble des parties prenantes puissent en retirer le plus de valeur possible</li>
                                        <li>Comment d&eacute;couper les stories pour qu’elles soient petites mais avec de la valeur ajout&eacute;e</li>
                                        <li>Comment d&eacute;terminer quelles stories sont utiles, et lesquelles ne sont que du vent</li>
                                        <li>Comment &eacute;viter d’&ecirc;tre coinc&eacute; dans des ‘stories techniques’</li>
                                        <li>Comment permettre aux sponsors m&eacute;tiers de prendre des d&eacute;cisions dans un p&eacute;rim&egrave;tre flexible et &eacute;viter le water-scrum-fall</li>
                                        <li>Comment prioriser efficacement et &eacute;viter les ‘pet features’ (fonctionnalit&eacute;s chouchou) qui ne produiront aucun impact</li>
                                        <li>Comment engager les sponsors m&eacute;tiers dans un haut niveau de discussion pour prioriser efficacement</li>
                                        <li>Comment relever et eviter les probl&egrave;mes communs que les &eacute;quipes ont avec les stories utilisateurs</li>
                                    </ul>

                                    <h3 class="post-title">Public attendu</h3>
                                    <p>C’est un atelier pour un large public comprenant les personnes investies dans des livraisons it&eacute;ratives (agile/lean/scrum/kanban) avec des user stories. Les business sponsors des projets apprendront &agrave; mieux communiquer avec les &eacute;quipes de livraison, et les membres de l’&eacute;quipe (d&eacute;veloppeurs, testeurs, analystes, products owners) apprendront &agrave; mieux engager leurs utilisateurs.</p>

                                </div>

                                <h3 class="post-title">Date et lieu</h3>
                                <p>La formation aura lieu chez Orange (22,rue du Château d'eau 33000 Bordeaux) les mercredi 29 et jeudi 30 octobre.</p>
                                <h3 class="post-title">Nombre de personnes</h3>
                                <p>La formation est limit&eacute;e &agrave; 20 personnes, afin de privil&eacute;gier les interactions</p>

                                <h3 class="post-title">Tarif</h3>
                                <p>La formation est bas&eacute;e sur un tarif de 1500&euro; HT par personne.</p>

                                <div class="table-responsive">
                                    <table class="table table-hover table-condensed table-bordered">
                                        <tbody>
                                            <tr>
                                                <th class="info">Nombre de<br>participants</th>
                                                <td>10</td><td>11</td><td>12</td><td>13</td><td>14</td><td>15</td><td>16</td><td>17</td><td>18</td><td>19</td><td>20</td>
                                            </tr>
                                            <tr>
                                                <th class="info">Tarif par<br>personne (HT)</th>
                                                <td>1&nbsp;500&nbsp;&euro;</td><td>1&nbsp;364&nbsp;&euro;</td><td>1&nbsp;250&nbsp;&euro;</td><td>1&nbsp;154&nbsp;&euro;</td><td>1&nbsp;071&nbsp;&euro;</td><td>1&nbsp;000&nbsp;&euro;</td><td>938&nbsp;&euro;</td><td>882&nbsp;&euro;</td><td>833&nbsp;&euro;</td><td>789&nbsp;&euro;</td><td>750&nbsp;&euro;</td>
                                            </tr>
                                        </tbody>
                                    </table>
                                </div>

                                <p><b>Tarif d&eacute;gressif jusqu'à 20 participants</b> : parlez de cette formation autour de vous pour faire baisser son tarif !</p>

                                <p><b>D&eacute;j&aacute; 10 places r&eacute;serv&eacute;es !</b> Encore quelques places disponibles, profitez-en et parlez-en autour de vous.</p>

                                <h3 class="post-title">Droit Individuel &agrave; la formation</h3>
                                <p>Pour des raisons de délais de traitement, nous n'acceptons plus de DIF pour les prochaines demandes.<br />
									Pour les personnes ayant bénéficié du DIF, le tarif dégressif ne s'applique pas dans ce cas-là.</p>

                                <h3 class="post-title">Inscriptions</h3>
                                <p>Un acompte de 750&euro; vous sera demand&eacute;.</p>

                                <p class="text-center">
                                    <a href="https://docs.google.com/forms/d/1d0Ec9GOc3rKMHtiPmMfIknbpNpRGp8c4SAcuOLy_bOI/viewform" target="_blank" class="btn btn-theme"> Inscription <i class="fa fa-external-link"></i></a>
                                </p>

                                <p>
                                    <b>* Un traducteur anglais -> français sera pr&eacute;sent durant la totalit&eacute; de la formation.</b>
                                </p>
                            </div>

                        </div>
                    </div>
                </article>

            </section>
            <!-- Content -->

        </div>
    </div>
</section>
<!-- /PAGE BLOG -->
