---
layout: default2014
title: P&ocirc;le emploi et l'agilit&eacute;
txt: La DSI P&ocirc;le emploi s’est engag&eacute;e depuis 5 ans dans une d&eacute;marche de d&eacute;ploiement de l’agilit&eacute; en son sein.
image: pole-emploi.jpg
wide-image: pole-emploi-wide.jpg
js:
- /static/js/post.js
---

<!-- PAGE BLOG -->
<section class="page-section with-sidebar sidebar-right">
    <div class="container">
        <div class="row">

            <!-- Content -->
            <section id="content" class="content col-sm-12 col-md-12">

                <article class="post-wrap" data-animation="fadeInUp" data-animation-delay="100">
                    <div class="post-header">
                        <h2 class="post-title"><a href="#">P&ocirc;le emploi et l'agilit&eacute;</a></h2>
                        <div class="post-meta">
                <span class="post-date">
                    Post&eacute;
                    <span class="day">16</span>
                    <span class="month">octobre</span>
                    <span class="year">2014</span>
                </span>
                        </div>
                    </div>
                    <div class="post-body">
                        <div class="post-excerpt">

                            <p>La DSI P&ocirc;le emploi s’est engag&eacute;e depuis 5 ans dans une d&eacute;marche de d&eacute;ploiement de l’agilit&eacute; en son sein.</p>

                            <p>La DSI s’appuie sur les 3 m&eacute;thodes suivantes :
                                <ul>
                                    <li><b>Scrum</b> est utilis&eacute;e sur des projets</li>
                                    <li><b>Kanban</b> est utilis&eacute;e sur des activit&eacute;s r&eacute;currentes telles que le support technique ou la maintenance corrective</li>
                                    <li><b>XP</b> est utilis&eacute;e en soutien de ces deux m&eacute;thodes pour renforcer l’excellence technique sur la base de pratiques comme la programmation en bin&ocirc;me, le d&eacute;veloppement pilot&eacute; par les tests ou l’int&eacute;gration continue</li>
                                </ul>
                            </p>

                            <img style="float:left; margin-right: 20px" src="/static/img/blog/article_pole_emploi1.jpg" class="img-responsive" />

                            <p>Environ 20% des collaborateurs AMOA et MOE utilisent la m&eacute;thode <b>Scrum</b>, et 5% utilisent la m&eacute;thode <b>Kanban</b> (les autres collaborateurs utilisent le cycle en V).
                            Pour favoriser la diffusion des pratiques agiles, prendre en charge la mont&eacute;e en comp&eacute;tences des &eacute;quipes de la DSI, un programme de formation – le plus souvent bas&eacute; sur des formations certifiantes – a &eacute;t&eacute; organis&eacute;.</p>

                            <p>A ce jour :
                                <ul>
                                    <li>56 agents de la DSI sont certifi&eacute;s <b>Scrum Product Owner</b></li>
                                    <li>56 sont certifi&eacute;s <b>Scrum Master</b></li>
                                    <li>1 est certifi&eacute; <b>Scrum Professionnel</b></li>
                                    <li>36 sont certifi&eacute;s <b>Manager agile</b></li>
                                    <li>20 sont certifi&eacute;s <b>Scrum Developer</b></li>
                                </ul>
                            </p>

                            <p>Des formations sont aussi d&eacute;livr&eacute;es autour de <b>Kanban</b> et sur la Conception Centr&eacute;e Utilisateur, pratique connexe &agrave; l’agilit&eacute;.
                            Enfin, la culture agile se diffuse au sein de la DSI P&ocirc;le emploi &agrave; travers d’&eacute;v&eacute;nements tels que les <b>" Scrum Caf&eacute; "</b> organis&eacute;s sur diff&eacute;rents sites ou des retours d’exp&eacute;rience externes r&eacute;alis&eacute;s dans le cadre d’actions sp&eacute;cifiques.</p>



                        </div>
                    </div>
                </article>

            </section>
            <!-- Content -->

        </div>
    </div>
</section>
<!-- /PAGE BLOG -->
