---
layout: default2014
title: Notre vision de l'agilit&eacute;
txt: L'article de notre sponsor - Upwiser.
image: upwiser.png
wide-image: upwiser-wide.png
js:
- /static/js/post.js
---

<!-- PAGE BLOG -->
<section class="page-section with-sidebar sidebar-right">
    <div class="container">
        <div class="row">

            <!-- Content -->
            <section id="content" class="content col-sm-12 col-md-12">

                <article class="post-wrap" data-animation="fadeInUp" data-animation-delay="100">
                    <div class="post-header">
                        <h2 class="post-title"><a href="#">Notre vision de l'agilit&eacute; - Upwiser</a></h2>
                        <div class="post-meta">
                <span class="post-date">
                    Post&eacute;
                    <span class="day">28</span>
                    <span class="month">octobre</span>
                    <span class="year">2014</span>
                </span>
                        </div>
                    </div>
                    <div class="post-body">
                        <div class="post-excerpt">

<p>Maturit&eacute;, humilit&eacute; et honn&ecirc;tet&eacute; sont les trois valeurs n&eacute;cessaires pour faire &eacute;merger l’agilit&eacute; au
sein d’une &eacute;quipe, d’une entreprise.<br />
De m&ecirc;me que l’absence de ces valeurs est souvent source de probl&egrave;mes dans la vie, elle est
un frein &agrave; la vraie productivit&eacute; en entreprise. Trop d’entreprises, trop d’&eacute;quipes s’enlisent car
elles n’ont pas su agir de mani&egrave;re sage, avec maturit&eacute;, humilit&eacute; et honn&ecirc;tet&eacute;.</p>
<p><b>“L'enfance est courte, la maturit&eacute; infinie”</b> Bill Watterson</p>
<p>La maturit&eacute; n'est pas quelque chose qui apparaît &agrave; partir d'un certain &acirc;ge. Ce n'est pas parce
qu'on a 25 ou 40 ans et qu'on a un bac + 2 ou + 5 qu'on est m&ucirc;r. La maturit&eacute; vient avec le v&eacute;cu,
avec l'exp&eacute;rience. Quand on devient m&ucirc;r, on parle de maturit&eacute; dans un domaine pr&eacute;cis. C'est le
savoir­faire de notre m&eacute;tier, savoir ce qu'il faut faire ou ne pas faire. Cette valeur m&egrave;ne &agrave;
l’excellence, &agrave; la s&eacute;r&eacute;nit&eacute; et au recul n&eacute;cessaire &agrave; l’agilit&eacute;.</p>
<p><b>“L’humilit&eacute; est l’antichambre de toutes les perfections”</b> Marcel Aym&eacute;</p>
<p>L'humilit&eacute; est fortement li&eacute;e &agrave; la maturit&eacute;. C'est savoir dire “j'ai eu tort et je le reconnais”. C'est
aussi savoir dire “vous avez eu raison”. C'est encore savoir dire “je ne sais pas”. Au contraire,
trop de fiert&eacute; conduit &agrave; vouloir cacher ses faiblesses et se croire infaillible. Chercher &agrave; l’&ecirc;tre nuit
&agrave; la transparence et &agrave; la collaboration en &eacute;quipe. Il faut &ecirc;tre humble pour savoir s’am&eacute;liorer, mais
aussi pour inspirer les autres en ce sens.</p>
<p><b>“D&eacute;saccord honn&ecirc;te est souvent signe de progr&egrave;s”</b> Mahatma Gandhi</p>
<p>Encore une fois, l'honn&ecirc;tet&eacute; est fortement li&eacute;e aux deux valeurs pr&eacute;c&eacute;dentes. L'honn&ecirc;tet&eacute; veut
dire "pas de mensonge". Ne jamais dire “oui” quand on n'est pas s&ucirc;r. C'est l'oppos&eacute; de "Oui
chef, on va faire l'effort". C'est plutôt "non les gars, je ne pense pas que ce soit la meilleure
chose &agrave; faire". C'est aussi l'honn&ecirc;tet&eacute; envers soi­m&ecirc;me. Une &eacute;quipe qui s’engage dans un
projet sans avoir vraiment estim&eacute; les t&acirc;ches n’est pas honn&ecirc;te. Son engagement n’est pas bas&eacute;
sur une r&eacute;alit&eacute;, mais sur du r&ecirc;ve. Nous, agilistes, ne r&ecirc;vons que d’une &eacute;quipe honn&ecirc;te.
C’est gr&acirc;ce &agrave; ces trois valeurs ­ honn&ecirc;tet&eacute;, humilit&eacute; et maturit&eacute; ­ que nous analysons notre
mani&egrave;re d’&ecirc;tre agile. Et cette inspection nous permet de constater certaines &eacute;vidences dans
notre pratique quotidienne. En voici quelques exemples.</p>
<p><b>“Le d&eacute;veloppement logiciel, c’est un peu comme une boite de chocolats, on ne sait jamais sur quoi on va tomber”</b></p>
<p>Se mettre en position de changer et de profiter du changement, ne pas attendre quelque chose
de particulier, mais &ecirc;tre pr&ecirc;t &agrave; agir. L’agilit&eacute;, c’est savoir appr&eacute;cier le chocolat que l’on a pioch&eacute;
dans la boîte. C’est aussi savoir utiliser la connaissance acquise durant sa d&eacute;gustation pour
mieux choisir le suivant : forme, couleur, go&ucirc;t. Autant d’informations qui permettent de choisir de
meilleurs chocolats, comme les interactions, mesures et exp&eacute;riences dans le d&eacute;veloppement
logiciel. Cette exp&eacute;rience s'acquiert gr&acirc;ce &agrave; la maturit&eacute; personnelle et collective.</p>
<p><b>“Pour faire de bonnes choses, il faut du temps.”</b></p>
<p>C’est toujours vrai, surtout pour les plats mijot&eacute;s. Lorsqu’on cuisine en suivant une recette, il est
rare de pouvoir s’arr&ecirc;ter avec la moiti&eacute; des ingr&eacute;dients ou en cours de cuisson. Une recette est
un tout qui permet quelques fantaisies, mais pas toujours de r&eacute;volution. Un menu, lui, permet de
composer &agrave; base de recettes de mani&egrave;re totalement originale, comme un logiciel est un tout &agrave;
base de composants, eux­m&ecirc;mes issus de recettes simples. La simplicit&eacute;, c’est ce que permet
l’humilit&eacute; dans sa conception, dans ses solutions &agrave; des probl&egrave;mes et dans l’application
quotidienne de pratiques agiles.</p>
<p><b>“L’agilit&eacute; ne s’est pas faite en un jour”</b></p>
<p>Comme certains menus ou logiciels, l’empire romain s’est fait en accumulant des conqu&ecirc;tes et
alliances. Chacune d’elles construisait un nouvel empire, plus grand et plus riche. Mais un
empire viable. Au fil de sa construction, il a fallu cr&eacute;er des lois, des arm&eacute;es, des infrastructures,
d&eacute;fendre, animer cet empire. Sans ces ingr&eacute;dients, jamais Rome n’aurait pu grandir autant. Et il
semble &eacute;vident qu’il a fallu du temps, des essais successifs et qu’il y a eu des erreurs sur le
chemin de cette construction. L’agilit&eacute;, c’est savoir utiliser ces avatars &agrave; bon escient et prendre
le chemin avec eux, sans les craindre car nous apprenons chaque jour &agrave; les &eacute;viter, et &agrave; les
&eacute;liminer de mani&egrave;re p&eacute;renne. C’est en &eacute;tant honn&ecirc;tes vis &agrave; vis de la situation et de nos erreurs
que nous pouvons cr&eacute;er cette am&eacute;lioration.</p>
<p>“L’agile ne fait pas le moine”</p>
<p>On a souvent entendu parler des diff&eacute;rences entre “faire de l’agilit&eacute;” et “&ecirc;tre agile”. Se parer de
pratiques et valeurs agiles est loin d’&ecirc;tre suffisant, il faut une pratique et une &eacute;tude r&eacute;guli&egrave;res
pour acqu&eacute;rir son exp&eacute;rience. La pi&eacute;t&eacute; et l’asc&egrave;se sont proches de ces principes : un agiliste
convaincu et convainquant se diff&eacute;rencie par le temps qu’il accepte de passer, de mani&egrave;re
d&eacute;lib&eacute;r&eacute;e, &agrave; am&eacute;liorer sa pratique du d&eacute;veloppement logiciel. Il reste humble et honn&ecirc;te face &agrave;
sa connaissance. Il acquiert son exp&eacute;rience pour atteindre la maturit&eacute;.</p>
<p>Pour conclure:<br />
<b>“C’est pas la taille de l’&eacute;p&eacute;e qui compte, c’est l’agilit&eacute; du
mousquetaire”</b></p>

                        </div>
                    </div>
                </article>

            </section>
            <!-- Content -->

        </div>
    </div>
</section>
<!-- /PAGE BLOG -->
