---
layout: default2013
title: Articles
---


<p style="font-family: 'Times New Roman'; font-size: medium; margin: 0px 0px 8px; overflow: hidden; text-overflow: ellipsis; word-wrap: break-word;"><span style="font-family: arial, helvetica, sans-serif;"><span style="color: #393939;"><span style="line-height: 18px;">L'histoire d'<a href="http://www.ayeba.fr">Ayeba</a> d&eacute;bute en 2009. Fruit de plusieurs ann&eacute;es d'exp&eacute;riences dans diff&eacute;rents secteurs&nbsp;</span></span><span style="line-height: 18px; color: #393939;">et de r&eacute;flexions, cette qu&ecirc;te s'est cristallis&eacute;e autour d'une question : pourquoi, quelque soit le secteur&nbsp; d'activit&eacute;s, la taille de l'entreprise, le domaine de comp&eacute;tences, les m&ecirc;mes probl&eacute;matiques humaines&nbsp;</span></span><span style="font-family: arial, helvetica, sans-serif; line-height: 18px; color: #393939;">et organisationnelles ressurgissent ? Cette question, c'est l'essence d'Ayeba. C'est elle qui a conduit&nbsp; Ayeba &agrave; repenser au travers de l'agilit&eacute; de nouveaux modes de fonctionnement, de mani&egrave;re &agrave;&nbsp;</span></span><span style="font-family: arial, helvetica, sans-serif; line-height: 18px; color: #393939;">apporter des solutions p&eacute;rennes aux organisations afin d'am&eacute;liorer leur performance.&nbsp;En effet, si les technologies et les modes de vie ont &eacute;t&eacute; boulevers&eacute;s depuis la r&eacute;volution industrielle,&nbsp;</span></span><span style="font-family: arial, helvetica, sans-serif; line-height: 18px; color: #393939;">les mod&egrave;les organisationnels &laquo;classiques&raquo; n'ont eux, pas, ou peu &eacute;volu&eacute;. Ces mod&egrave;les anciens,&nbsp;th&eacute;oris&eacute;s par F.Taylor en 1911, sont profond&eacute;ment enracin&eacute;s dans notre conception de notre&nbsp;</span></span><span style="font-family: arial, helvetica, sans-serif; line-height: 18px; color: #393939;">environnement, symbolis&eacute;s par une organisation pyramidale bas&eacute;e sur une hi&eacute;rarchie forte, ces&nbsp;</span><span style="line-height: 18px; color: #393939; font-family: arial, helvetica, sans-serif;">sch&eacute;mas perdurent.</span></p>
<p style="font-family: 'Times New Roman'; font-size: medium; margin: 0px 0px 8px; overflow: hidden; text-overflow: ellipsis; word-wrap: break-word;"><span style="font-family: arial, helvetica, sans-serif;"><span style="color: #393939;"><span style="line-height: 18px;">Si les connaissances de l'&eacute;poque sur les m&eacute;canismes de motivation &eacute;taient relativement limit&eacute;es,&nbsp;</span></span><span style="line-height: 18px; color: #393939;">elles ont fait, aujourd'hui, l'objet de nombreuses &eacute;tudes qui s'accordent sur la n&eacute;cessit&eacute; de mettre en&nbsp; place des mod&egrave;les de fonctionnements radicalement diff&eacute;rents. Certains pr&eacute;curseurs ont initi&eacute; ces&nbsp;</span></span><span style="font-family: arial, helvetica, sans-serif; line-height: 18px; color: #393939;">nouveaux mod&egrave;les et ont prouv&eacute; leur efficacit&eacute; : 3M, Favi, Southwest Airlines, Canon ou encore&nbsp;Gore-Tex. N&eacute;anmoins, ces mod&egrave;les peinent &agrave; se diffuser et &agrave; s'imposer comme des r&eacute;f&eacute;rences, tout&nbsp;</span></span><span style="font-family: arial, helvetica, sans-serif; line-height: 18px; color: #393939;">en restant des exemples &laquo;isol&eacute;s&raquo; mais r&eacute;guli&egrave;rement cit&eacute;s. Plus r&eacute;cemment d'autres entreprises,&nbsp;port&eacute;es par le num&eacute;rique, ont elles aussi repens&eacute;es leur mode de fonctionnement &agrave; l'image de&nbsp;</span></span><span style="font-family: arial, helvetica, sans-serif; line-height: 18px; color: #393939;">Google, Athlasian, Amazon, Facebook, Netflix, Valve, GitHub&hellip;</span></p>
<p style="font-family: 'Times New Roman'; font-size: medium; margin: 0px 0px 8px; overflow: hidden; text-overflow: ellipsis; word-wrap: break-word;"><span style="font-family: arial, helvetica, sans-serif;"><span style="color: #393939;"><span style="line-height: 18px;">De ces nombreuses initiatives et exemples de r&eacute;ussites, sont n&eacute;es des m&eacute;thodologies visant &agrave;&nbsp;</span></span><span style="line-height: 18px; color: #393939;">structurer de nouveaux modes de fonctionnement. Parmi elles, l'agilit&eacute;, s'est r&eacute;pandue, de part sa&nbsp;dimension pragmatique et ses valeurs universelles. Au-del&agrave; d'une m&eacute;thodologie, c'est un nouvel art&nbsp;</span></span><span style="font-family: arial, helvetica, sans-serif; line-height: 18px; color: #393939;">de travailler (de vivre !) qui a &eacute;merg&eacute;, favorisant le bien-&ecirc;tre et le partage. Ayeba est devenu l'un de&nbsp;</span><span style="line-height: 18px; color: #393939; font-family: arial, helvetica, sans-serif;">ses relais, une forme de traducteur afin de passer de la th&eacute;orie &agrave; la pratique.</span></p>