---
layout: default2013
title: Articles
---

<style>
  .default {
    margin: 0px 0px 8px;
    overflow: hidden;
    text-overflow: ellipsis;
    word-wrap: break-word;
    color: #393939;
    font-family: 'Helvetica Neue', Arial, Helvetica, sans-serif;
    line-height: 18px;
    }
  
</style>

<p class="default"><a href="http://www.yaal.fr">Yaal</a> est fond&eacute;e en f&eacute;vrier 2010 avec l'objectif de cr&eacute;er un contexte propice &agrave; l'agilit&eacute;, sans limite. L'aventure ne fut pas de tout repos ni sans certains accrocs, mais nous sommes aujourd'hui tr&egrave;s fiers de ce que nous avons construit. Nous allons tenter par ces quelques lignes de vous d&eacute;crire ce qui fait aujourd'hui notre force et notre fiert&eacute;. Peut-&ecirc;tre cela vous sera-t-il utile pour tenter une exp&eacute;rience similaire &agrave; la n&ocirc;tre ? peut-&ecirc;tre cela vous donnera-t-il envie de nous rejoindre ?</p>
<p class="default"><a href="http://www.yaal.fr">Yaal</a> ce sont des startups dans lesquelles nous avons choisi d'investir techniquement :&nbsp;<a href="https://yuticket.com/" target="_blank">yuticket.com</a>,&nbsp;<a href="http://jestocke.com/" target="_blank">jestocke.com</a>&nbsp;et <a href="http://myelefant.com/" target="_blank">myelefant.com</a>.</p>
<p class="default">Pourquoi investissons-nous ? Pour cr&eacute;er une confiance durable avec les porteurs de projet. Parce qu'ainsi nous avons la conviction que chacun fait du mieux qu'il peut en fonction des besoins commerciaux et des finances disponibles. Parce qu'ainsi notre contractualisation est r&eacute;duite &agrave; l'essentiel : nos destins sont li&eacute;s et c'est dans la collaboration que nous r&eacute;ussirons.</p>
<p class="default"><a href="http://www.yaal.fr">Yaal</a> c'est une &eacute;quipe d'associ&eacute;s-salari&eacute;s : Arthur est g&eacute;rant et strat&egrave;ge, Aur&eacute;lien est pilote fonctionnel, Justin est designer web, Bruno et St&eacute;phane sont d&eacute;veloppeurs, Colin est d&eacute;veloppeur et facilitateur.</p>
<p class="default">Pourquoi sommes-nous (bient&ocirc;t) tous associ&eacute;s ? Pour garantir le bien-&ecirc;tre de chacun et donc de notre organisation. Pour nous assurer que chacun puisse entreprendre toutes les actions n&eacute;cessaires &agrave; la satisfaction des clients, tout aussi surprenantes qu'elles puissent &ecirc;tre. Nous sommes libres, ensemble, d&eacute;mocratiquement, pour nous et pour nos clients.</p>
<p class="default"><a href="http://www.yaal.fr">Yaal</a> ce sont des processus l&eacute;gers, pour plus d'efficacit&eacute; et plus de plaisir !</p>
<p class="default">Nous nous r&eacute;unissons toutes les semaines pour aborder tout sujet qui le m&eacute;rite. Nous nous r&eacute;unissons tous les mois pour actualiser notre vision de Yaal &agrave; 1 mois, 3 mois, 6 mois, 1 an et 3 an. Nous nous dotons de m&eacute;triques de performance. La comptabilit&eacute; est ouverte. Nous invitons nos clients &agrave; partager nos bureaux quand ils le souhaitent. Nous faisons du TDD et des revues de code. Nous bin&ocirc;mons ou programmons c&ocirc;te &agrave; c&ocirc;te. Nous d&eacute;ployons nos logiciels en quelques secondes, en int&eacute;gration, recette ou production, 10 fois par jour si besoin.</p>
<p class="default"><a href="http://www.yaal.fr">Yaal</a> c'est enfin l'environnement de travail que nous nous sommes construit : des bureaux en plein centre de Bordeaux, <a href="http://www.cyclable.com/blog/magasins/bordeaux/un-velo-de-fonction">des v&eacute;los de fonction haut de gamme</a>, des doubles &eacute;crans 24'', disques SSD, Macbook air, &eacute;cran Thunderbolt, t&eacute;l&eacute;phones et ordinateurs portables.</p>
<p class="default">Et aujourd'hui, nous sommes heureux de nous lever tous les matins, fiers de notre quotidien \o/</p>
